devdnl/dnx-rtos/src/system/drivers/eth/stm32fx/eth.c
        return err;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *rdctr                  number of read bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_READ(ETH,
             void            *device_handle,
             u8_t            *dst,
             size_t           count,
             fpos_t          *fpos,
             size_t          *rdctr,
             struct vfs_fattr fattr)
{
        UNUSED_ARG2(fpos, fattr);

        struct eth *hdl = device_handle;

        ETH_packet_t pkt;
        pkt.payload = dst;
        pkt.length  = min(count, ETH_MAX_PACKET_SIZE);
        int err = packet_receive(hdl, &pkt);
        if (!err) {
                *rdctr = pkt.length;
        }

        return err;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_IOCTL(ETH, void *device_handle, int request, void *arg)
{
        struct eth *hdl = device_handle;

        int err = EINVAL;

        switch (request) {
        case IOCTL_ETH__CONFIGURE:
                if (arg) {
                        err = eth_configure(hdl, arg);
                }
                break;

        case IOCTL_ETH__SEND_PACKET:
                if (arg) {
                        err = packet_send(hdl, arg);
                }
                break;

        case IOCTL_ETH__RECEIVE_PACKET:
                if (arg) {
                        err = packet_receive(hdl, arg);
                }
                break;

        case IOCTL_ETH__SET_RX_TIMEOUT:
                if (arg) {
                        hdl->rx_timeout_ms = *cast(u32_t*, arg);
                }
                break;

        case IOCTL_ETH__SET_TX_TIMEOUT:
                if (arg) {
                        hdl->tx_timeout_ms = *cast(u32_t*, arg);
                }
                break;

        case IOCTL_ETH__START:
                err = eth_start(hdl);
                break;

        case IOCTL_ETH__STOP:
                err = eth_stop(hdl);
                break;

        case IOCTL_ETH__GET_STATUS:
                if (arg) {
                        err = eth_get_info(hdl, arg);
                }
                break;

        default:
                return EBADRQC;
        }

        return err;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_FLUSH(ETH, void *device_handle)
{
        struct eth *hdl = device_handle;
        int err = eth_flush(hdl);
        return err;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_STAT(ETH, void *device_handle, struct vfs_dev_stat *device_stat)
{
        UNUSED_ARG1(device_handle);

        device_stat->st_size  = 0;
        device_stat->st_major = 0;
        device_stat->st_minor = 0;

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Configure Ethernet interface.
 *
 * @param  hdl          device handle
 * @param  conf         configuration
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
static int eth_configure(struct eth *hdl, const ETH_config_t *conf)
{
        int err = sys_mutex_lock(hdl->mutex, MUTEX_TIMEOUT);
        if (!err) {
                if (not hdl->run) {
                        if (hdl->configured) {
                                HAL_ETH_DeInit(&hdl->eth);
                        }

                        memcpy(hdl->MAC_addr, conf->MAC, sizeof(hdl->MAC_addr));

                        hdl->eth.Instance = ETH;
                        hdl->eth.Init.MACAddr = hdl->MAC_addr;
                        hdl->eth.Init.AutoNegotiation = __ETH_PHY_AUTONEGOTIATION__;
                        hdl->eth.Init.Speed = __ETH_SPEED__;
                        hdl->eth.Init.DuplexMode = ETH_MODE_FULLDUPLEX;
                        hdl->eth.Init.RxMode = ETH_RXINTERRUPT_MODE;
                        hdl->eth.Init.ChecksumMode = __ETH_CHECKSUM_BY_HARDWARE__;
                        hdl->eth.Init.PhyAddress = __ETH_PHY_ADDRESS__;

                        err = HAL_ETH_Init(&hdl->eth);
                        if (!err) {
                                /* Initialize Tx Descriptors list: Chain Mode */
                                HAL_ETH_DMATxDescListInit(&hdl->eth, hdl->DMA_tx_desc,
                                                          hdl->tx_buff, __ETH_TXBUFNB__);

                                /* Initialize Rx Descriptors list: Chain Mode  */
                                HAL_ETH_DMARxDescListInit(&hdl->eth, hdl->DMA_rx_desc,
                                                          hdl->rx_buff, __ETH_RXBUFNB__);
                                eth->configured = true;
                        }
                }

                sys_mutex_unlock(hdl->mutex);
        }

