devdnl/dnx-rtos/src/system/drivers/eth/stm32fx/eth.c
        int err = sys_mutex_lock(hdl->mutex, MUTEX_TIMEOUT);
        if (!err) {

                __IO ETH_DMADescTypeDef *DmaTxDesc = hdl->eth.TxDesc;

                _cpuctl_invalidate_dcache_by_addr((uint32_t*)DmaTxDesc, sizeof(ETH_DMADescTypeDef));

                u64_t tref = sys_get_uptime_ms();
                while ((DmaTxDesc->Status & ETH_DMATXDESC_OWN) != (uint32_t) RESET) {
                        sys_sleep_ms(1);
                        if (sys_get_uptime_ms() - tref >= hdl->tx_timeout_ms) {
                                err = ETIME;
                                goto finish;
                        }
                        _cpuctl_invalidate_dcache_by_addr((uint32_t*)DmaTxDesc, sizeof(ETH_DMADescTypeDef));
                }

                /* Copy the remaining bytes */
                uint8_t *buffer = (uint8_t*) (DmaTxDesc->Buffer1Addr);
                memcpy(buffer, pkt->payload, pkt->length);

                _cpuctl_clean_dcache_by_addr((uint32_t*)buffer, pkt->length);

                /* Prepare transmit descriptors to give to DMA */
                err = HAL_ETH_TransmitFrame(&hdl->eth, pkt->length);

                /* When Transmit Underflow flag is set, clear it and issue a Transmit Poll Demand to resume transmission */
                if ((hdl->eth.Instance->DMASR & ETH_DMASR_TUS) != (uint32_t) RESET) {
                        /* Clear TUS ETHERNET DMA flag */
                        hdl->eth.Instance->DMASR = ETH_DMASR_TUS;

                        /* Resume DMA transmission*/
                        hdl->eth.Instance->DMATPDR = 0;
                }

                /* update statistics */
                update_dropped_rx_frames(hdl);
                hdl->stats.tx_packets++;
                hdl->stats.tx_bytes += pkt->length;

                finish:
                sys_mutex_unlock(hdl->mutex);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Receive packet.
 *
 * @param  hdl          device handle
 * @param  pkt          packet data
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
static int packet_receive(struct eth *hdl, ETH_packet_t *pkt)
{
        if (not hdl->run) {
                return EPERM;
        }

        int err = sys_semaphore_wait(hdl->rx_semaphore, hdl->rx_timeout_ms);
        if (!err) {
                err = sys_mutex_lock(hdl->mutex, MUTEX_TIMEOUT);
                if (!err) {
                        /* get received frame */
                        if (HAL_ETH_GetReceivedFrame_IT(&hdl->eth) != HAL_OK) {
                                printk("ETH: frame receive error");
                                err = EIO;
                                goto finish;
                        }

                        /* Obtain the size of the packet and put it into the "len" variable. */
                        uint16_t len = hdl->eth.RxFrameInfos.length;
                        uint8_t *buffer = (uint8_t*)hdl->eth.RxFrameInfos.buffer;

                        if (len > 0) {
                                pkt->length = len;
                                _cpuctl_invalidate_dcache_by_addr((uint32_t*)buffer, len);
                                memcpy(pkt->payload, buffer, min(pkt->length, len));
                        }

                        /* Release descriptors to DMA */
                        __IO ETH_DMADescTypeDef *dmarxdesc = hdl->eth.RxFrameInfos.FSRxDesc;

                        /* Set Own bit in Rx descriptors: gives the buffers back to DMA */
                        for (u32_t i = 0; i < hdl->eth.RxFrameInfos.SegCount; i++) {
                                dmarxdesc->Status |= ETH_DMARXDESC_OWN;
                                _cpuctl_clean_dcache_by_addr((uint32_t*)dmarxdesc, sizeof(ETH_DMADescTypeDef));
                                dmarxdesc = (ETH_DMADescTypeDef*)(dmarxdesc->Buffer2NextDescAddr);
                        }

                        /* Clear Segment_Count */
                        hdl->eth.RxFrameInfos.SegCount = 0;

                        /* When Rx Buffer unavailable flag is set: clear it and resume reception */
                        if ((hdl->eth.Instance->DMASR & ETH_DMASR_RBUS) != (uint32_t) RESET) {
                                /* Clear RBUS ETHERNET DMA flag */
                                hdl->eth.Instance->DMASR = ETH_DMASR_RBUS;
                                /* Resume DMA reception */
                                hdl->eth.Instance->DMARPDR = 0;
                        }

                        /* update statistics */
                        update_dropped_rx_frames(hdl);
                        hdl->stats.rx_packets++;
                        hdl->stats.rx_bytes += len;

                        finish:
                        sys_mutex_unlock(hdl->mutex);
                } else {
                        sys_semaphore_signal(hdl->rx_semaphore);
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief  Low level Ethernet initialization (library callback).
 *
 * @param  heth         hal ethernet handler
 */
//==============================================================================
void HAL_ETH_MspInit(ETH_HandleTypeDef *heth)
{
        UNUSED_ARG1(heth);

        /* Enable the Ethernet global Interrupt */
        NVIC_SetPriority(ETH_IRQn, _CPU_IRQ_SAFE_PRIORITY_);
        NVIC_EnableIRQ(ETH_IRQn);

        SET_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACEN);
        volatile u32_t tmp = READ_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACEN);

        SET_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACTXEN);
        tmp = READ_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACTXEN);

        SET_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACRXEN);
        tmp = READ_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACRXEN);

        UNUSED_ARG1(tmp);
}

//==============================================================================
/**
 * @brief  Low level Ethernet deinitialization (library callback).
 *
 * @param  heth         hal ethernet handler
 */
//==============================================================================
void HAL_ETH_MspDeInit(ETH_HandleTypeDef *heth)
{
        UNUSED_ARG1(heth);

        NVIC_DisableIRQ(ETH_IRQn);

        CLEAR_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACEN);
        volatile u32_t tmp = READ_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACEN);

