devdnl/dnx-rtos/src/system/drivers/eth/stm32fx/eth.c
        CLEAR_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACTXEN);
        tmp = READ_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACTXEN);

        CLEAR_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACRXEN);
        tmp = READ_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACRXEN);

        UNUSED_ARG1(tmp);
}

//==============================================================================
/**
 * @brief  Packet receive complete callback (library callback).
 *
 * @param  heth         hal ethernet handler
 */
//==============================================================================
void HAL_ETH_RxCpltCallback(ETH_HandleTypeDef *heth)
{
        UNUSED_ARG1(heth);
        sys_semaphore_signal_from_ISR(eth->rx_semaphore, &eth->irq_yield);
}

//==============================================================================
/**
 * @brief  Read number of dropped frames.
 *
 * @param  hdl          device handle
 */
//==============================================================================
static void update_dropped_rx_frames(struct eth *hdl)
{
        u32_t DMAMFBOCR = ETH->DMAMFBOCR;
        u32_t MFC = (DMAMFBOCR & ETH_DMAMFBOCR_MFC) >> ETH_DMAMFBOCR_MFC_Pos;
        hdl->stats.rx_dropped_frames += MFC;
}

//==============================================================================
/**
 * @brief  Ethernet interrupt
 * @param  None
 * @return None
 */
//==============================================================================
void ETH_IRQHandler(void)
{
        HAL_ETH_IRQHandler(&eth->eth);
        sys_thread_yield_from_ISR(eth->irq_yield);
}

/*==============================================================================
  End of file
==============================================================================*/
